"""Бинарный поиск - это алгоритм; на входе он получает отсортированный
список элементов. Бинарный поиск работает только в том случае, если список отсортирован.
Если элемент, который вы ищете, присутствует в списке, то бинарный поиск возвращает ту позицию, в которой он был найден.
В противном случае бинарный поиск возвращает null.
"""


class BinarySearch:
    def iterative_method(self, a, q):
        # хранятся границы той части списка, в которой выполняется поиск
        low = 0
        high = len(a) - 1

        # пока эта часть не сократится до одного элемента ...
        while low <= high:
            # ... проверяем средний элемент
            mid = (low + high) // 2
            guess = a[mid]
            # значение найдено
            if guess == q:
                return mid
            # много
            if guess > q:
                high = mid - 1
            # мало
            else:
                low = mid + 1

        # значение не найдено
        return None


if __name__ == "__main__":
    bin_search = BinarySearch()
    a = [1, 5, 10, 17, 29]

    print(bin_search.iterative_method(a, 17))
